import requests, pymongo
from bs4 import BeautifulSoup

f = open('dic.gzt', 'w')
f.write('encoding "utf8";\n')
f.write('import "base.proto";\n')
f.write('import "articles_base.proto";\n')
f.write('import "fact_types.proto";\n')
f.write('import "kwtypes.proto";\n')
f.write('TAuxDicArticle "FormulaExtract"{key = {"tomita:first_grammar.cxx" type=CUSTOM}}\n')
f.write('TAuxDicArticle attractions{\n')
f.write('key = "Казанский кафедральный собор" | "Волгоградская областная филармония" | "Авангард" | "Областная универсальная научная библиотека им. М. Горького" | "Площадь Павших Борцов" | "Памятник Саше Филиппову" | "Музей истории Кировского района" | "Памятник чекистам" | "Армянская церковь Святого Георгия" | "Трамвай-памятник" | "Воинский эшелон" | "Мельница Гергардта" | "Памятник Дзержинскому" | "Здание Царицынской пожарной команды" | "Дом Павлова" | "Челябинский колхозник" | "Памятник Гоголю" | "БК-13" | "Бейт Давид" | "Бармалей" | "Лысая гора" | "Элеватор" | "Памятник Паникахе" | "Фонтан влюбленных" | "Музей-квартира Луконина М.К." | "Музейно-выставочный центр Красноармейского района" | "Мамаев курган" | "Речной порт" | "Царицынская опера" | "Музей истории здравоохранения" | \'Музей "Дети Царицына, Сталинграда, Волгограда"\' | "Народный музей Волгоградских железнодорожников" | "Музей авиации" | "Выставочный зал Волгоградского музея изобразительных искусств им. И.И.Машкова" | "Военно-патриотический музей истории связи и радиолюбительства Царицына-Сталинграда-Волгограда" | "Парк имени Юрия Гагарина" | \'Музей "истории Волго-Донского судоходного канала"\' | "Выставочный зал Волгоградской областной организации союза художников России" | "Парк Победы" | "Комсомольский сад" | "Детский городской парк" | "Сквер имени Саши Филиппова" | \'Парк Дружбы: "Волгоград-Баку"\' | "Зал Воинской Славы" | "Ботанический сад ВГСПУ" | "ЦПКиО" | "Музей музыкальных инструментов им. Е.Н. Пушкина" | "Музей мер и весов" | "Областной краеведческий музей" | \'Музей-заповедник "Старая Сарепта"\' | "Планетарий" | "Память" | "Волгоградский музей изобразительных искусств им. И.И. Машкова" | \'Музей-панорама "Сталинградская битва"\' | "Мемориально-исторический музей" | "Горсад" | "Волгоград Арена"\n')
f.write('}\n')
f.write('celebrities "бузова_ольга_игоревна"\n{\nkey="Бузова" | "Ольга Бузова" | "Бузова Ольга Игоревна" | "Бузова О.И.";\nlemma="Бузова Ольга"\n}\n')

for i in range(9):

    url = 'https://global-volgograd.ru/person?offset=' + str(20 * i)
    response = requests.get(url)
    soup = BeautifulSoup(response.text, 'lxml')
    persons = soup.find_all('div', class_='person-block')

    for person in persons:
        personName = person.find('div', class_='title').text
        personName = personName.title()
        personName = personName.strip()
        personNames = personName.split(' ')
        f.write('celebrities "' + personNames[0].lower() + '_' + personNames[1].lower() + '"\n{\nkey="')
        f.write(personNames[0] + '" | "'  + personNames[1] + ' ' + personNames[0] + '" | "')
        f.write(personName + '"')
        if (len(personNames)==3):
            f.write(' | "' + personNames[0] + ' ' + personNames[1][0] + '. ' + personNames[2][0] + '."')
        elif (len(personNames)==2):
            f.write(' | "' + personNames[0] + ' ' + personNames[1][0] + '."')
        f.write(';\nlemma="')
        f.write(personNames[0] + ' ' + personNames[1] + '"\n}\n')
            
f.close()
